isc-fs/stm32-can-bootloader/Core/Src/main.c
	/* Make sure RTC clock is enabled so backup registers are accessible */
	if ((RCC->BDCR & RCC_BDCR_RTCEN) == 0U) {
		__HAL_RCC_RTC_ENABLE();
	}

	uint32_t val = RTC->BKP0R;

	if (val == BL_BOOT_REQ_MAGIC) {
		/* Clear the flag so we do not stay in bootloader forever */
		RTC->BKP0R = 0U;
		return 1U;
	}

	/* #145: the RTC->BKP0R magic above is volatile — POR/BOR wipes it, so a
	 * power-cycle would otherwise auto-jump into a known-bad app the operator
	 * had parked in the BL (recovery = SWD = open the enclosure). A persistent
	 * NVM flag (sector 7) survives POR; honour it too. NOT one-shot — it holds
	 * across every reset until cleared by a FLASH_VERIFY (a new good image) or
	 * an explicit boot (JUMP / RESET mode 3); see bl_proto.c. */
	uint8_t stay_val = 0U;
	uint8_t stay_len = 0U;
	if (bl_nvm_read(BL_NVM_KEY_STAY_IN_BL, &stay_val, sizeof(stay_val), &stay_len) == BL_NVM_OK
	    && stay_len == 1U && stay_val == 1U) {
		return 1U;
	}

	return 0U;
}

/* #142: one-shot "boot the app via a clean reset" request. Set by
 * handle_jump / handle_reset (bl_proto) when a flash write happened in the
 * session; consumed here on the next boot. Reads + clears BKP0R only if it
 * holds BL_BOOT_APP_MAGIC, so a BL_BOOT_REQ_MAGIC (stay-in-BL) request is
 * left intact for Bootloader_IsBootRequestActive. */
static uint8_t Bootloader_IsBootAppRequestActive(void) {
	HAL_PWR_EnableBkUpAccess();
	if ((RCC->BDCR & RCC_BDCR_RTCEN) == 0U) {
		__HAL_RCC_RTC_ENABLE();
	}
	if (RTC->BKP0R == BL_BOOT_APP_MAGIC) {
		RTC->BKP0R = 0U;   /* one-shot */
		return 1U;
	}
	return 0U;
}

/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
	/* #125 H6: HAL failures (mostly clock config in SystemClock_Config)
	 * used to spin here forever — a marginal HSE would leave the board
	 * dead before CAN even started. Reboot instead so a transient
	 * failure self-recovers; a hard failure loops slowly (bl_fault's
	 * dwell) and stays SWD-recoverable. */
	__disable_irq();
	bl_fault_reboot(BL_FAULT_ERROR_HANDLER);
  /* USER CODE END Error_Handler_Debug */
}
#ifdef USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
